app/controllers/articles_controller.rb

  def index
    @article = Article.all
---
SELECT `articles`.* FROM `articles`

  def show
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

  def edit
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2016-09-29 10:09:44', 'Yeessss', 'Hello rails!', '2016-09-29 10:09:44')

  def update
    @article = Article.find(params[:id])

    if @article.update_attributes(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `text` = 'Yeessss!!!!!!!!!1', `updated_at` = '2016-09-29 10:12:43' WHERE `articles`.`id` = 1

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 2